# -*- coding: utf-8 -*-
"""hw2.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/18adpC1MVFPcdNDPwE8_kqZLnbDePkLVh
"""

#Задание 1
#Пользователь вводит целое число. Проверьте, является ли это число четным.
#Если число является четным, выведите «Данное число четное», если наоборот – выведите «Данное число не является четным»

num = int(input('введите число '))
if num % 2 == 0:
  print(f'{num} - четное число')
else:
  print(f'{num} - нечетное число')

#Задание 2
#Пользователь вводит 2 числа.
#Вывести на экран большее из этих чисел
a = float(input('введите число 1 '))
b = float(input('введите число 2 '))
if a > b:
  print(f'{int(a)} - наибольшее число')
elif a == b:
  print(f'наибольшее число {int(a)} - числа равны')
else:
  print(f'{int(b)} - наибольшее число')

#Задание 3
#Проверить является ли клетка шахматной доски белой
#Пользователь вводит 2 числа (координаты клетки шахматного поля, от 1 до 8)
# Вывести YES, если клетка белая, и NO, если клетка черная
a = int(input('введите координаты шахматной клетки 1 '))
b = int(input('введите координаты шахматной  клетки 2 '))
if (a + b) % 2 == 0:
  print('NO - клетка черная')
else:
  print('YES - клетка белая')