# -*- coding: utf-8 -*-
"""hw3.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1LiLHQ4hgg_JLNjkFhXsn4yKkN2kEN0e7
"""

#Задача 1. Напишите программу, которая находит сумму цифр заданного числа.
#Например, для числа 123 сумма цифр равна 1 + 2 + 3 = 6
n = int(input('введите число '))
sum = 0
while n > 0:
  a = n % 10
  sum += a
  n = n // 10
print(f'сумма введенного числа = {sum}')

#Задача 2. Вите очень понравилась идея Фёдора с калькулятором,
#он захотел создать свой, но чтобы не повторять идею друга полностью,
#решил сделать калькулятор, который перемножает числа от 1 до n. Тем более,
#у получившегося произведения есть название - факториал. Обозначается он так: n!
#Вводится натуральное число n. Выведи результат умножения чисел от 1 до n.
n = int(input('введите число '))
s = 1
for i in range(1,n+1):
  s *= i
print(f'факториал {n} = {s}')

#Задача 3. Миша учит признаки делимости чисел на 7. Чтобы себя проверить, он написал программу,
#которая выводит все числа, кратные семи до числа n. Есть целое число n. Вывести в столбик все такие числа.
n = int(input('введите число '))
print(f'числа кратные 7 в {n}: ')
for i in range(1, n+1):
    if i % 7 == 0:
        print("-", i)