# -*- coding: utf-8 -*-
"""hw8.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1okfCyeVO6V30ybJ2JwtJ2gumGgFYO_R-

Напишите рекурсивную функцию, которая находит максимальное число в заданном списке. Программа должна работать для любого количества чисел. Встроенную функцию max() использовать нельзя.
"""

#решение рекурсией
def find_max(lst):
    if len(lst) == 1:
        return lst[0]
    res_max = find_max(lst[1:])
    return lst[0] if lst[0] > res_max else res_max

list_recur = [34, 2, 3, 52, 9, 3]
result = find_max(list_recur)
print(result)

#доп решение без рекурсии
def max_num_1(a):
  max_n = a[0]
  for i in range(1,len(a)):
    if max_n < a[i]:
      max_n =  a[i]
  return max_n

list1 = [1,3,7,11,2,31,1,34,2,32]
max_num_1(list1)