# -*- coding: utf-8 -*-
"""hw-2-1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1TJv5Y-EeAdqwYHSQmE0oJQIUF-0iCvzH

Задача 1:
Создайте вектор из 100 случайных чисел от 1 до 10, по аналогии, как был создан вектор из 5 случайных чисел от 1 до 2: arr = np.random.randint(1, 2, size=5). Посчитайте, не используя циклы, какой процент элементов в векторе больше 7.

Задача 2: Проведите опыт из предыдущей задачи 1000 раз, а именно, создание вектора и подсчёт процента элементов, больших 7. Какая часть полученных результатов равно 20 %?

Задача 3:
Создайте матрицу numpy 10 x 10, где каждая строка будет выглядеть, как 1, 2, 3, 4, 5, 6, 7, 8, 9, 10. Желательно не использовать циклы.

Задача 4: Не используя циклы, найдите суммы элементов матрицы в каждом столбце.
"""

import numpy as np
arr = np.random.randint(1, 11, size=100)
print(np.mean(arr > 7) * 100)

import numpy as np

count = 0

for i in range(1,1001):
    arr = np.random.randint(1, 11, size=100)
    if np.mean(arr > 7) * 100 == 20:
        count += 1

print(count / 1000)

import numpy as np

print(np.tile(np.arange(1, 11), (10, 1)))

print(np.sum(np.tile(np.arange(1, 11), (10, 1)), axis=0))